In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel("filtered_transactions.xlsx" )

In [3]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

## Re-indexing & Altering labels

In [4]:
data = pd.DataFrame(
    {
        "Name": ["Alice", "Bob", "Charlie"],
        "Age": [10, 20, 30]
    },
    #index=["a", "b", "c"]
)

In [5]:
data

      Name  Age
0    Alice   10
1      Bob   20
2  Charlie   30

In [6]:
data.index=["a", "b", "c"] # add a , b , c index in data frame

In [7]:
data

      Name  Age
a    Alice   10
b      Bob   20
c  Charlie   30

In [8]:
df.reindex(["c" , "a" , "b"])  # value line change by index

   customer_id name transaction_date  amount category
c          NaN  NaN              NaT     NaN      NaN
a          NaN  NaN              NaT     NaN      NaN
b          NaN  NaN              NaT     NaN      NaN

In [9]:
df.reindex(["c" , "a" , "b" , "p"]) # if index is not available values are given NaN

   customer_id name transaction_date  amount category
c          NaN  NaN              NaT     NaN      NaN
a          NaN  NaN              NaT     NaN      NaN
b          NaN  NaN              NaT     NaN      NaN
p          NaN  NaN              NaT     NaN      NaN

In [10]:
df.reindex(["p" , "q" , "r"])

   customer_id name transaction_date  amount category
p          NaN  NaN              NaT     NaN      NaN
q          NaN  NaN              NaT     NaN      NaN
r          NaN  NaN              NaT     NaN      NaN

In [11]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [12]:
df.reindex(columns=["Age","Name"]) # reindex by columns

      Age  Name
0     NaN   NaN
1     NaN   NaN
2     NaN   NaN
3     NaN   NaN
4     NaN   NaN
...   ...   ...
1045  NaN   NaN
1046  NaN   NaN
1047  NaN   NaN
1048  NaN   NaN
1049  NaN   NaN

[1050 rows x 2 columns]

### rename index and columns

In [13]:
df.rename(index={'p' : 'a' , 'q' : 'b' , 'r' : 'c'} , columns={'Name' : 'First Name' , 'Age' : 'Current Age'}) # change name of raw and columns

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

### Directly replace Index or columns labels

In [14]:
df.index = ['X' , 'Y' , 'Z']
df.columns = ['Person name' , 'Person Age']

ValueError: Length mismatch: Expected axis has 1050 elements, new values have 3 elements

In [ ]:
df

In [ ]:
print(df.index)

In [ ]:
print(df.columns)

In [ ]:
df.reset_index(inplace = True , drop = True) # Main dataset change ---> defult index + "X" , "Y" , "Z" columns

In [ ]:
df

In [ ]:
df.drop(columns= ["index"] , inplace=True) # index vali columns remove

In [ ]:
df

## Pivoting

In [ ]:
data = {
    "Date" : ["2024-01-01" , "2024-01-02" , "2024-01-01" , "2024-01-02"] ,
    "Product" : ["laptop" , "mouse" , "laptop" , "mouse"] ,
    "sales" : [1200 , 1000 , 3200 , 1500]
}
df = pd.DataFrame(data)

In [ ]:
df

         Date Product  sales
0  2024-01-01  laptop   1200
1  2024-01-02   mouse   1000
2  2024-01-01  laptop   3200
3  2024-01-02   mouse   1500

In [ ]:
df.pivot_table(index="Date" , columns="Product" , values="sales",aggfunc="sum")

Product     laptop   mouse
Date
2024-01-01  4400.0     NaN
2024-01-02     NaN  2500.0

In [ ]:
df.pivot_table(index = "Product" , columns = "Date" , values = "sales") # aggfunc = "mean" is by dafult available

Date     2024-01-01  2024-01-02
Product
laptop       2200.0         NaN
mouse           NaN      1250.0

In [ ]:
df.pivot_table(index = "Date" , columns = "Product" , values = "sales" , aggfunc = "min")

Product     laptop   mouse
Date
2024-01-01  1200.0     NaN
2024-01-02     NaN  1000.0

In [ ]:
df.pivot_table(index = "Date" , columns = "Product" , values = "sales" , aggfunc = "max")

Product     laptop   mouse
Date
2024-01-01  3200.0     NaN
2024-01-02     NaN  1500.0

In [ ]:
data2 = {
    "Date" : ["2024-01-01" , "2024-01-02" , "2024-01-03" ,"2024-01-04" , "2024-01-05" , "2024-01-06"] , 
    "Product" : ["Laptop" , "Mouse" , "Laptop" , "Mouse" , "Laptop" , "Mouse"] , 
    "Sales" : [1200 , 100 , 1300 , 120 , 560 , 320]
    
}
df2 = pd.DataFrame(data2)

In [ ]:
df2.pivot_table(index = "Date" , columns = "Product" , values = "Sales") # by dafult mean givan

Product     Laptop  Mouse
Date
2024-01-01  1200.0    NaN
2024-01-02     NaN  100.0
2024-01-03  1300.0    NaN
2024-01-04     NaN  120.0
2024-01-05   560.0    NaN
2024-01-06     NaN  320.0

In [ ]:
df2.pivot_table(index="Date", columns="Product", values="Sales", aggfunc="sum")

In [ ]:
df_trans = pd.read_csv("transactions.csv")

In [ ]:
df_trans

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857      NaN
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [ ]:
print(df_trans.pivot_table(index = "category" , columns = "name" ,values = "amount" , aggfunc = "mean"))

name      Alice Brown   Bob Wilson  Charlie Davis   John Smith
category
A         1013.098322  1007.145509     978.734140  1016.928494
B          995.399100  1001.289501     989.217648  1022.436821
C          987.403818   982.914803    1028.884271   979.868461

In [ ]:
print(df_trans.pivot_table(index = "category" , columns = "name" ,values = "amount" , aggfunc = "min"))

name      Alice Brown  Bob Wilson  Charlie Davis  John Smith
category
A          701.930958  700.080816     717.501858  728.885702
B          707.564512  708.816033     703.303479  700.812175
C          702.291954  707.261870     703.137768  705.954293

In [ ]:
print(df_trans.pivot_table(index = "category" , columns = "name" ,values = "amount" , aggfunc = "max"))

name      Alice Brown   Bob Wilson  Charlie Davis   John Smith
category
A         1288.778254  1295.085971    1290.801844  1290.466191
B         1288.443606  1297.800603    1298.692513  1290.112884
C         1296.891576  1297.262510    1295.953009  1299.008507

In [ ]:
pivot_tbl = (df_trans.pivot_table(index = "category" , columns = "name" ,values = "amount" , aggfunc = "sum"))

In [ ]:
print(pivot_tbl)

name        Alice Brown     Bob Wilson  Charlie Davis     John Smith
category
A          50654.916080   65464.458093   66553.921547   78303.494025
B          68682.537866   47060.606561   69245.235392   77705.198415
C         131324.707842  105171.883924  132726.070909  111705.004519

In [ ]:
print(pivot_tbl["Alice Brown"].sum())

250662.161788

In [ ]:
for col in pivot_tbl.columns:
    print(f"{col} => {pivot_tbl[col].sum()}")  # all name ke sath sum

Alice Brown => 250662.161788
Bob Wilson => 217696.948578
Charlie Davis => 268525.227848
John Smith => 267713.696959

In [ ]:
data = {
    "Department" : ['IT' , 'IT' , 'HR' , 'HR' , 'Fiance' , 'Fiance'] , 
    "Employee" :   ['A' , 'B' , 'C' , 'D' , 'E' , 'F'] ,
    "Salery" :     [50000 , 60000 , 70000 , 80000 , 90000 , 100000] 
    
    
}

In [ ]:
df_hr = pd.DataFrame(data)

In [ ]:
df_hr

  Department Employee  Salery
0         IT        A   50000
1         IT        B   60000
2         HR        C   70000
3         HR        D   80000
4     Fiance        E   90000
5     Fiance        F  100000

In [ ]:
#df_hr.groupby(by = "Department")
#df_hr.groupby(by = "Department")["salary"]

In [ ]:
df_hr.groupby(by = "Department")["Salery"].mean()

Department
Fiance    95000.0
HR        75000.0
IT        55000.0
Name: Salery, dtype: float64

In [ ]:
df_hr.groupby(by = ["Department" , "Employee"])["Salery"].mean()

Department  Employee
Fiance      E            90000.0
            F           100000.0
HR          C            70000.0
            D            80000.0
IT          A            50000.0
            B            60000.0
Name: Salery, dtype: float64

In [ ]:
df_hr.groupby(by = ["Department" , "Employee"])["Salery"].agg(["sum" , "mean" , "count"])

                        sum      mean  count
Department Employee
Fiance     E          90000   90000.0      1
           F         100000  100000.0      1
HR         C          70000   70000.0      1
           D          80000   80000.0      1
IT         A          50000   50000.0      1
           B          60000   60000.0      1

In [ ]:
df_hr.groupby(by = ["Department" , "Employee"])["Salery"].agg(Total_sum = "sum" , Avg = "mean" , count = "count" )

                     Total_sum       Avg  count
Department Employee
Fiance     E             90000   90000.0      1
           F            100000  100000.0      1
HR         C             70000   70000.0      1
           D             80000   80000.0      1
IT         A             50000   50000.0      1
           B             60000   60000.0      1

In [15]:
#- using groupby().apply() with custom function

In [16]:
df = pd.DataFrame({
   "Team"    : ['A' , 'A' , 'B' , 'B' , 'C' , 'C'] ,
    "Player" : ['P1' , 'P2' , 'P3' , 'P4' , 'P5' , 'P6'] , 
    "Score"  : [15 , 18 , 10 , 25 , 20 , 23]
})

In [17]:
df

  Team Player  Score
0    A     P1     15
1    A     P2     18
2    B     P3     10
3    B     P4     25
4    C     P5     20
5    C     P6     23

In [22]:
def score_diff(x):
    return x.max() - x.min()

ans = df.groupby("Team")["Score"].apply(score_diff)  # apply se udf function auto call ho jata hai
#ans = df.groupby("Team")["Score"]
ans

Team
A     3
B    15
C     3
Name: Score, dtype: int64

In [28]:
# filter groups with team total score > 35

total_score = df.groupby("Team")["Score"].sum()
#print(total_score)

high_score_teams = total_score[total_score>35].index 
#print(high_score_teams)

filtered_df = df[df["Team"].isin(high_score_teams)]
filtered_df

  Team Player  Score
4    C     P5     20
5    C     P6     23

### Transform function

In [29]:
df

  Team Player  Score
0    A     P1     15
1    A     P2     18
2    B     P3     10
3    B     P4     25
4    C     P5     20
5    C     P6     23

In [ ]:
df ["New_score"] = df["Score"].transform(lambda x: x+5) # add 5 in score and add 1 new columns of new score
df

  Team Player  Score  New_score
0    A     P1     15         20
1    A     P2     18         23
2    B     P3     10         15
3    B     P4     25         30
4    C     P5     20         25
5    C     P6     23         28

In [ ]:
def disp(n):
    return n + 10

df["Diff_score"] = df["Score"].transform(disp) # add 10 in score and add 1 new columns of Diff score by UDF
df

In [33]:
df

  Team Player  Score  New_score  Diff_score
0    A     P1     15         20          25
1    A     P2     18         23          28
2    B     P3     10         15          20
3    B     P4     25         30          35
4    C     P5     20         25          30
5    C     P6     23         28          33

In [ ]:
df.drop(columns = ["New_score" , "Diff_score"] , inplace = True) # remove added 2 columns

In [35]:
df

  Team Player  Score
0    A     P1     15
1    A     P2     18
2    B     P3     10
3    B     P4     25
4    C     P5     20
5    C     P6     23

In [ ]:
df["Avg_score"] = df.groupby(by = "Team")["Score"].transform("mean") # agg function - mean

In [37]:
df

  Team Player  Score  Avg_score
0    A     P1     15       16.5
1    A     P2     18       16.5
2    B     P3     10       17.5
3    B     P4     25       17.5
4    C     P5     20       21.5
5    C     P6     23       21.5

In [ ]:
df.groupby(by = "Team")["Score"].apply("mean") # mean of team score

Team
A    16.5
B    17.5
C    21.5
Name: Score, dtype: float64